Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.2.54/Microchip.SAML21_DFP.pdsc
<?xml version='1.0' encoding='ASCII'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.3" xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd" xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Microchip</vendor>
   <url>https://packs.download.microchip.com/</url>
   <name>SAML21_DFP</name>
   <description>Microchip SAML21 Series Device Support</description>
   <releases>
      <release version="3.2.54" date="2019-12-12">NEXT</release>
      <release version="3.1.43" date="2019-10-07">Updated captions and registers in CCL and OPAMP. Use generated startup and system code for ARMCC and IAR. Added XC32 content.</release>
      <release version="3.0.26" date="2019-04-17">Added programming/debugging support in MPLAB X. Removed legacy headers</release>
      <release version="2.0.2" date="2019-01-24">Succeeds Atmel.SAML21_DFP 1.2.125.</release>
   </releases>
   <keywords>
      <keyword>Microchip</keyword>
      <keyword>Device Family Package Microchip</keyword>
      <keyword>Device Support</keyword>
      <keyword>SAML21</keyword>
   </keywords>
   <devices>
      <family Dfamily="SAML21" Dvendor="Microchip:3">
         <description>ARM Cortex-M0+ based ultra-low-power microcontroller with 64KB Flash, 12KB SRAM, 48 MHz, six 16-bit timer/counters, DMA, six SERCOMs, USB Host and Device, 14-channel 12-bit ADC, 2-channel 12-bit DAC, 48 pins</description>
         <description>ARM Cortex-M0+ based ultra-low-power microcontroller with 128KB Flash, 24KB SRAM, 48 MHz, six 16-bit timer/counters, DMA, six SERCOMs, USB Host and Device, 14-channel 12-bit ADC, 2-channel 12-bit DAC, 48 pins</description>
         <description>ARM Cortex-M0+ based ultra-low-power microcontroller with 256KB Flash, 40KB SRAM, 48 MHz, six 16-bit timer/counters, DMA, six SERCOMs, USB Host and Device, 14-channel 12-bit ADC, 2-channel 12-bit DAC, 48 pins</description>
         <description>ARM Cortex-M0+ based ultra-low-power microcontroller with 32KB Flash, 6KB SRAM, 48 MHz, six 16-bit timer/counters, DMA, four SERCOMs, USB Host and Device, 10-channel 12-bit ADC, 2-channel 12-bit DAC, 32 pins</description>
         <description>ARM Cortex-M0+ based ultra-low-power microcontroller with 64KB Flash, 12KB SRAM, 48 MHz, six 16-bit timer/counters, DMA, four SERCOMs, USB Host and Device, 10-channel 12-bit ADC, 2-channel 12-bit DAC, 32 pins</description>
         <description>ARM Cortex-M0+ based ultra-low-power microcontroller with 128KB Flash, 24KB SRAM, 48 MHz, six 16-bit timer/counters, DMA, four SERCOMs, USB Host and Device, 10-channel 12-bit ADC, 2-channel 12-bit DAC, 32 pins</description>
         <description>ARM Cortex-M0+ based ultra-low-power microcontroller with 128KB Flash, 24KB SRAM, 48 MHz, eight 16-bit timer/counters, DMA, six SERCOMs, USB Host and Device, 20-channel 12-bit ADC, 2-channel 12-bit DAC, 64 pins</description>
         <description>ARM Cortex-M0+ based ultra-low-power microcontroller with 64KB Flash, 12KB SRAM, 48 MHz, eight 16-bit timer/counters, DMA, six SERCOMs, USB Host and Device, 20-channel 12-bit ADC, 2-channel 12-bit DAC, 64 pins</description>
         <description>ARM Cortex-M0+ based ultra-low-power microcontroller with 256KB Flash, 40KB SRAM, 48 MHz, six 16-bit timer/counters, DMA, four SERCOMs, USB Host and Device, 10-channel 12-bit ADC, 2-channel 12-bit DAC, 32 pins</description>
         <environment name="microchip">
            <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
               <mchp:prerequisite component="MPLAB X IDE" version="[5.10-"/>
            </mchp:extension>
         </environment>
         <device Dname="ATSAML21G16B">
            <processor Dcore="Cortex-M0+" Dendian="Little-endian" Dmpu="NO_MPU" Dfpu="NO_FPU"/>
            <compile header="saml21b/include/sam.h" define="__SAML21G16B__"/>
            <debug svd="saml21b/svd/ATSAML21G16B.svd"/>
            <memory id="IROM1" start="0x00000000" size="0x10000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00400000" size="0x800"/>
            <memory id="IRAM1" start="0x20000000" size="0x2000" default="1"/>
            <memory id="IRAM2" start="0x30000000" size="0x1000"/>
            <algorithm name="saml21b/keil/flashloader/Flash/ATSAML21_64.FLM" start="0x00000000" size="0x10000" default="1"/>
            <algorithm name="saml21b/keil/flashloader/Flash/ATSAML21_64_EEPROM.FLM" start="0x00400000" size="0x00800" default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="saml21b/atdf/ATSAML21G16B.atdf"/>
                  <at:variant ordercode="SAML21G16B-MU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAML21G16B-MN" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="105"/>
                  <at:variant ordercode="SAML21G16B-AU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAML21G16B-AN" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="105"/>
                  <at:memory name="FLASH" start="0x00000000" size="0x10000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="CAL" start="0x00800000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="LOCKBIT" start="0x00802000" size="0x4" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP1" start="0x00806000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP2" start="0x00806008" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP3" start="0x00806010" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP4" start="0x00806018" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP5" start="0x00806020" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="TEMP_LOG" start="0x00806030" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="RWW" start="0x00400000" size="0x800" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HSRAM" start="0x20000000" size="0x2000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="LPRAM" start="0x30000000" size="0x1000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HPB0" start="0x40000000" size="0x4000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB2" start="0x42000000" size="0x8000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB3" start="0x43000000" size="0x2000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB4" start="0x44000000" size="0x1000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="saml21b/edc/ATSAML21G16B.PIC"/>
                  <mchp:xc32 name="saml21b/xc32"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <description>ARM Cortex-M0+ based ultra-low-power microcontroller with 64KB Flash, 12KB SRAM, 48 MHz, six 16-bit timer/counters, DMA, six SERCOMs, USB Host and Device, 14-channel 12-bit ADC, 2-channel 12-bit DAC, 48 pins</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAML21G16B" title="Device page for ATSAML21G16B"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAML21G16B" title="Datasheet"/>
         </device>
         <device Dname="ATSAML21G17B">
            <processor Dcore="Cortex-M0+" Dendian="Little-endian" Dmpu="NO_MPU" Dfpu="NO_FPU"/>
            <compile header="saml21b/include/sam.h" define="__SAML21G17B__"/>
            <debug svd="saml21b/svd/ATSAML21G17B.svd"/>
            <memory id="IROM1" start="0x00000000" size="0x20000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00400000" size="0x1000"/>
            <memory id="IRAM1" start="0x20000000" size="0x4000" default="1"/>
            <memory id="IRAM2" start="0x30000000" size="0x2000"/>
            <algorithm name="saml21b/keil/flashloader/Flash/ATSAML21_128.FLM" start="0x00000000" size="0x20000" default="1"/>
            <algorithm name="saml21b/keil/flashloader/Flash/ATSAML21_128_EEPROM.FLM" start="0x00400000" size="0x01000" default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="saml21b/atdf/ATSAML21G17B.atdf"/>
                  <at:variant ordercode="SAML21G17B-MU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAML21G17B-MN" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="105"/>
                  <at:variant ordercode="SAML21G17B-AU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAML21G17B-AN" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="105"/>
                  <at:memory name="FLASH" start="0x00000000" size="0x20000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="CAL" start="0x00800000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="LOCKBIT" start="0x00802000" size="0x4" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP1" start="0x00806000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP2" start="0x00806008" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP3" start="0x00806010" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP4" start="0x00806018" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP5" start="0x00806020" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="TEMP_LOG" start="0x00806030" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="RWW" start="0x00400000" size="0x1000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HSRAM" start="0x20000000" size="0x4000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="LPRAM" start="0x30000000" size="0x2000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HPB0" start="0x40000000" size="0x4000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB2" start="0x42000000" size="0x8000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB3" start="0x43000000" size="0x2000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB4" start="0x44000000" size="0x1000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="saml21b/edc/ATSAML21G17B.PIC"/>
                  <mchp:xc32 name="saml21b/xc32"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <description>ARM Cortex-M0+ based ultra-low-power microcontroller with 128KB Flash, 24KB SRAM, 48 MHz, six 16-bit timer/counters, DMA, six SERCOMs, USB Host and Device, 14-channel 12-bit ADC, 2-channel 12-bit DAC, 48 pins</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAML21G17B" title="Device page for ATSAML21G17B"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAML21G17B" title="Datasheet"/>
         </device>
