Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.2.54/Microchip.SAML21_DFP.pdsc
         <device Dname="ATSAML21G18B">
            <processor Dcore="Cortex-M0+" Dendian="Little-endian" Dmpu="NO_MPU" Dfpu="NO_FPU"/>
            <compile header="saml21b/include/sam.h" define="__SAML21G18B__"/>
            <debug svd="saml21b/svd/ATSAML21G18B.svd"/>
            <memory id="IROM1" start="0x00000000" size="0x40000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00400000" size="0x2000"/>
            <memory id="IRAM1" start="0x20000000" size="0x8000" default="1"/>
            <memory id="IRAM2" start="0x30000000" size="0x2000"/>
            <algorithm name="saml21b/keil/flashloader/Flash/ATSAML21_256.FLM" start="0x00000000" size="0x40000" default="1"/>
            <algorithm name="saml21b/keil/flashloader/Flash/ATSAML21_256_EEPROM.FLM" start="0x00400000" size="0x02000" default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="saml21b/atdf/ATSAML21G18B.atdf"/>
                  <at:variant ordercode="SAML21G18B-MU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAML21G18B-MN" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="105"/>
                  <at:variant ordercode="SAML21G18B-AU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAML21G18B-AN" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="105"/>
                  <at:memory name="FLASH" start="0x00000000" size="0x40000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="CAL" start="0x00800000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="LOCKBIT" start="0x00802000" size="0x4" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP1" start="0x00806000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP2" start="0x00806008" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP3" start="0x00806010" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP4" start="0x00806018" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP5" start="0x00806020" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="TEMP_LOG" start="0x00806030" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="RWW" start="0x00400000" size="0x2000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HSRAM" start="0x20000000" size="0x8000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="LPRAM" start="0x30000000" size="0x2000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HPB0" start="0x40000000" size="0x4000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB2" start="0x42000000" size="0x8000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB3" start="0x43000000" size="0x2000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB4" start="0x44000000" size="0x1000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="saml21b/edc/ATSAML21G18B.PIC"/>
                  <mchp:xc32 name="saml21b/xc32"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <description>ARM Cortex-M0+ based ultra-low-power microcontroller with 256KB Flash, 40KB SRAM, 48 MHz, six 16-bit timer/counters, DMA, six SERCOMs, USB Host and Device, 14-channel 12-bit ADC, 2-channel 12-bit DAC, 48 pins</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAML21G18B" title="Device page for ATSAML21G18B"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAML21G18B" title="Datasheet"/>
         </device>
         <device Dname="ATSAML21G18A">
            <processor Dcore="Cortex-M0+" Dendian="Little-endian" Dmpu="NO_MPU" Dfpu="NO_FPU"/>
            <compile header="saml21a1/include/sam.h" define="__SAML21G18A__"/>
            <debug svd="saml21a1/svd/ATSAML21G18A.svd"/>
            <memory id="IROM1" start="0x00000000" size="0x40000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00400000" size="0x2000"/>
            <memory id="IRAM1" start="0x20000000" size="0x8000" default="1"/>
            <memory id="IRAM2" start="0x30000000" size="0x2000"/>
            <algorithm name="saml21a1/keil/flashloader/Flash/ATSAML21_256.FLM" start="0x00000000" size="0x40000" default="1"/>
            <algorithm name="saml21a1/keil/flashloader/Flash/ATSAML21_256_EEPROM.FLM" start="0x00400000" size="0x02000" default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="saml21a1/atdf/ATSAML21G18A.atdf"/>
                  <at:variant ordercode="SAML21G18A-MU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAML21G18A-AU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:memory name="FLASH" start="0x00000000" size="0x40000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="CAL" start="0x00800000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="LOCKBIT" start="0x00802000" size="0x4" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP1" start="0x00806000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP2" start="0x00806008" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP3" start="0x00806010" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP4" start="0x00806018" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP5" start="0x00806020" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="TEMP_LOG" start="0x00806030" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="RWW" start="0x00400000" size="0x2000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HSRAM" start="0x20000000" size="0x8000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="LPRAM" start="0x30000000" size="0x2000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HPB0" start="0x40000000" size="0x4000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB2" start="0x42000000" size="0x8000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB3" start="0x43000000" size="0x2000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB4" start="0x44000000" size="0x1000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="saml21a1/edc/ATSAML21G18A.PIC"/>
                  <mchp:xc32 name="saml21a1/xc32"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAML21G18A" title="Device page for ATSAML21G18A"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAML21G18A" title="Datasheet"/>
         </device>
         <device Dname="ATSAML21E15B">
            <processor Dcore="Cortex-M0+" Dendian="Little-endian" Dmpu="NO_MPU" Dfpu="NO_FPU"/>
            <compile header="saml21b/include/sam.h" define="__SAML21E15B__"/>
            <debug svd="saml21b/svd/ATSAML21E15B.svd"/>
            <memory id="IROM1" start="0x00000000" size="0x8000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00400000" size="0x400"/>
            <memory id="IRAM1" start="0x20000000" size="0x1000" default="1"/>
            <memory id="IRAM2" start="0x30000000" size="0x800"/>
            <algorithm name="saml21b/keil/flashloader/Flash/ATSAML21_32.FLM" start="0x00000000" size="0x08000" default="1"/>
            <algorithm name="saml21b/keil/flashloader/Flash/ATSAML21_32_EEPROM.FLM" start="0x00400000" size="0x00400" default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="saml21b/atdf/ATSAML21E15B.atdf"/>
                  <at:variant ordercode="SAML21E15B-MU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAML21E15B-MN" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="105"/>
                  <at:variant ordercode="SAML21E15B-AU" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAML21E15B-AN" vccmin="1.62" vccmax="3.63" tempmin="-40" tempmax="105"/>
                  <at:memory name="FLASH" start="0x00000000" size="0x8000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="CAL" start="0x00800000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="LOCKBIT" start="0x00802000" size="0x4" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP1" start="0x00806000" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP2" start="0x00806008" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP3" start="0x00806010" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP4" start="0x00806018" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="OTP5" start="0x00806020" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="TEMP_LOG" start="0x00806030" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="RWW" start="0x00400000" size="0x400" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HSRAM" start="0x20000000" size="0x1000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="LPRAM" start="0x30000000" size="0x800" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HPB0" start="0x40000000" size="0x4000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB2" start="0x42000000" size="0x8000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB3" start="0x43000000" size="0x2000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB4" start="0x44000000" size="0x1000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="saml21b/edc/ATSAML21E15B.PIC"/>
                  <mchp:xc32 name="saml21b/xc32"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <description>ARM Cortex-M0+ based ultra-low-power microcontroller with 32KB Flash, 6KB SRAM, 48 MHz, six 16-bit timer/counters, DMA, four SERCOMs, USB Host and Device, 10-channel 12-bit ADC, 2-channel 12-bit DAC, 32 pins</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAML21E15B" title="Device page for ATSAML21E15B"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAML21E15B" title="Datasheet"/>
         </device>
