Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.2.54/Microchip.SAML21_DFP.pdsc
      <condition id="ATSAML21G18B">
         <require Dvendor="Microchip:3" Dname="ATSAML21G18B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML21G18A">
         <require Dvendor="Microchip:3" Dname="ATSAML21G18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML21E15B">
         <require Dvendor="Microchip:3" Dname="ATSAML21E15B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML21E16B">
         <require Dvendor="Microchip:3" Dname="ATSAML21E16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML21E17B">
         <require Dvendor="Microchip:3" Dname="ATSAML21E17B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML21J17B">
         <require Dvendor="Microchip:3" Dname="ATSAML21J17B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML21J16B">
         <require Dvendor="Microchip:3" Dname="ATSAML21J16B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML21J18A">
         <require Dvendor="Microchip:3" Dname="ATSAML21J18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML21J18B">
         <require Dvendor="Microchip:3" Dname="ATSAML21J18B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML21J17BU">
         <require Dvendor="Microchip:3" Dname="ATSAML21J17BU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML21E18A">
         <require Dvendor="Microchip:3" Dname="ATSAML21E18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML21J18BU">
         <require Dvendor="Microchip:3" Dname="ATSAML21J18BU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAML21E18B">
         <require Dvendor="Microchip:3" Dname="ATSAML21E18B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAML21G16B">
         <description>Headers and startup code for Microchip ATSAML21G16B</description>
         <files>
            <file condition="C" category="include" name="saml21b/include"/>
            <file condition="C" category="header" name="saml21b/include/sam.h"/>
            <file condition="C Exe" category="source" name="saml21b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="saml21b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="saml21b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="saml21b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="saml21b/gcc/gcc/startup_saml21g16b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="saml21b/gcc/system_saml21g16b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="saml21b/gcc/gcc/saml21g16b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="saml21b/gcc/gcc/saml21g16b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="saml21b/armcc/armcc/startup_saml21g16b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="saml21b/armcc/system_saml21g16b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="saml21b/iar/system_saml21.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="saml21b/iar/iar/startup_saml21.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="saml21b/iar/iar/saml21g16b_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="saml21b/iar/iar/saml21g16b_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAML21G17B">
         <description>Headers and startup code for Microchip ATSAML21G17B</description>
         <files>
            <file condition="C" category="include" name="saml21b/include"/>
            <file condition="C" category="header" name="saml21b/include/sam.h"/>
            <file condition="C Exe" category="source" name="saml21b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="saml21b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="saml21b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="saml21b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="saml21b/gcc/gcc/startup_saml21g17b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="saml21b/gcc/system_saml21g17b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="saml21b/gcc/gcc/saml21g17b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="saml21b/gcc/gcc/saml21g17b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="saml21b/armcc/armcc/startup_saml21g17b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="saml21b/armcc/system_saml21g17b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="saml21b/iar/system_saml21.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="saml21b/iar/iar/startup_saml21.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="saml21b/iar/iar/saml21g17b_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="saml21b/iar/iar/saml21g17b_sram.icf" attr="config"/>
         </files>
      </component>
