Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.2.54/Microchip.SAML21_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAML21G18B">
         <description>Headers and startup code for Microchip ATSAML21G18B</description>
         <files>
            <file condition="C" category="include" name="saml21b/include"/>
            <file condition="C" category="header" name="saml21b/include/sam.h"/>
            <file condition="C Exe" category="source" name="saml21b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="saml21b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="saml21b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="saml21b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="saml21b/gcc/gcc/startup_saml21g18b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="saml21b/gcc/system_saml21g18b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="saml21b/gcc/gcc/saml21g18b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="saml21b/gcc/gcc/saml21g18b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="saml21b/armcc/armcc/startup_saml21g18b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="saml21b/armcc/system_saml21g18b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="saml21b/iar/system_saml21.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="saml21b/iar/iar/startup_saml21.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="saml21b/iar/iar/saml21g18b_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="saml21b/iar/iar/saml21g18b_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAML21G18A">
         <description>Headers and startup code for Microchip ATSAML21G18A</description>
         <files>
            <file condition="C" category="include" name="saml21a1/include"/>
            <file condition="C" category="header" name="saml21a1/include/sam.h"/>
            <file condition="C Exe" category="source" name="saml21a1/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="saml21a1/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="saml21a1/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="saml21a1/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="saml21a1/gcc/gcc/startup_saml21g18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="saml21a1/gcc/system_saml21g18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="saml21a1/gcc/gcc/saml21g18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="saml21a1/gcc/gcc/saml21g18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="saml21a1/armcc/armcc/startup_saml21g18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="saml21a1/armcc/system_saml21g18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="saml21a1/iar/system_saml21.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="saml21a1/iar/iar/startup_saml21.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="saml21a1/iar/iar/saml21g18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="saml21a1/iar/iar/saml21g18a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ATSAML21E15B">
         <description>Headers and startup code for Microchip ATSAML21E15B</description>
         <files>
            <file condition="C" category="include" name="saml21b/include"/>
            <file condition="C" category="header" name="saml21b/include/sam.h"/>
            <file condition="C Exe" category="source" name="saml21b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="saml21b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="saml21b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="saml21b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="saml21b/gcc/gcc/startup_saml21e15b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="saml21b/gcc/system_saml21e15b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="saml21b/gcc/gcc/saml21e15b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="saml21b/gcc/gcc/saml21e15b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="saml21b/armcc/armcc/startup_saml21e15b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="saml21b/armcc/system_saml21e15b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="saml21b/iar/system_saml21.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="saml21b/iar/iar/startup_saml21.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="saml21b/iar/iar/saml21e15b_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="saml21b/iar/iar/saml21e15b_sram.icf" attr="config"/>
         </files>
      </component>
